<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"5dda937e3e3494e9921d8dbba7566e71378e24c1f6386f5d8fbe78d9bb85edab","plan_job_ref":"Job .github/workflows/_test-tf.yaml #233 at https://github.com/tx-pts-dai/github-workflows/actions/runs/12488549128","plan_out_hash":"36cb79201c83e3f12764a6e9cbaedccb1da6d6cd7bc78849b74664535972dfd9","plan_hash":"8b1aadc6bbbb91bf8c5206629087c0e03936a3b09af7e7346d53560abd2bf7ff","plan_text_format":"diff","version":"1.45.0"} -->
Terraform plan in __tests/terraform/s3__
With backend config: `bucket=tf-state-911453050078
key=sandbox1.tfstate
workspace_key_prefix=github-workflows
`
With var files: `tests/terraform/s3/environment/sandbox.tfvars`
<details>
<summary>Plan: 2 to add, 0 to change, 0 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # random_id.this will be created
+   resource "random_id" "this" {
+       b64_std     = (known after apply)
+       b64_url     = (known after apply)
+       byte_length = 4
+       dec         = (known after apply)
+       hex         = (known after apply)
+       id          = (known after apply)
    }

  # random_pet.this will be created
+   resource "random_pet" "this" {
+       id        = (known after apply)
+       length    = 2
+       separator = "-"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+   random_id  = (known after apply)
+   random_pet = (known after apply)
```
</details>

:memo: Plan generated in [.github/workflows/_test-tf.yaml #233](https://github.com/tx-pts-dai/github-workflows/actions/runs/12488549128)